import type {Translations} from './_types';

const translations: Translations = {
  accessTheLesson: 'Перейти к уроку',
  authenticationMagicLinkHeader:
    'Нажмите на полученную в электронном сообщении ссылку для подключения к платформе',
  authenticationMagicLinkStepOneDescription:
    'Зайдите в <b>рабочий почтовый ящик</b> с помощью этого телефона',
  authenticationMagicLinkStepTwoDescription:
    '<b>Открыть электронное сообщение</b> с приглашением скачать приложение Coorpacademy',
  authenticationMagicLinkStepThreeDescription:
    'Нажмите на кнопку <b>"Подключиться к приложению"</b>',
  authenticationMagicLinkTitle: 'Волшебная ссылка',
  authenticationQRCodeHeader:
    'Вы не получили сообщения по электронной почте? Ничего страшного! Мы проверим вашу идентификационную информацию на веб-платформе с помощью компьютера',
  authenticationQRCodeStepOneDescription:
    'Подключиться к вашей учебной платформе <b>с помощью компьютера</b>',
  authenticationQRCodeStepTwoDescription:
    'Перейдите в <b>свой аккаунт</b> <br/>в правом верхнем углу',
  authenticationQRCodeStepThreeDescription:
    '<b>Готово!</b><br/>сканируйте свой QR-код с помощью кнопки ниже',
  authenticationQRCodeTitle: 'QR-код',
  askForHelp: 'Попросить помощи',
  backToHome: 'Назад на главную',
  bonus: 'Бонус!',
  cancel: 'Отменить',
  clue: 'Подсказка',
  clueStarsToLoose:
    'Разблокировав подсказку, вы уменьшите количество звезд, которые вы можете выиграть в этом вопросе, на {{count}} (если ответите правильно)',
  congratulations: 'Поздравляем!',
  connectionLost: 'Отсутствует интернет соединение',
  connectionRestored: 'Сейчас вы подключены к сети интернет',
  context: 'Контекст',
  correction: 'Исправление',
  dataLost: 'Кажется, ваши данные потеряны',
  didYouKnowThat: 'Вы знали это?',
  finishCourse: 'Закончить курс',
  finishCourseWordings: [
    {
      title: 'Давайте сделаем это, {{givenName}}! 🚀',
      description: 'Завершите этот курс: «{{contentName}}»',
    },
    {
      title: 'Ваша миссия, если вы решите принять ее 😎',
      description: 'Завершите курс «{{contentName}}»',
    },
    {
      title: '{{givenName}}, спорим, Вы сможете это сделать! 💪',
      description: 'Завершите курс «{{contentName}}»',
    },
    {title: 'Готовы изучить {{givenName}}? 💪', description: 'Давайте завершим «{{contentName}}»'},
    {
      title: '{{givenName}}, вы почти завершили курс 🙃',
      description: 'Давайте закончим «{{contentName}}»',
    },
    {title: 'Примите вызов, {{givenName}} 💪', description: 'Пройдите курс «{{contentName}}»'},
    {title: '{{givenName}}, вот ваш вызов дня! 😉', description: 'Пройдите курс {{contentName}}'},
    {title: '{{givenName}}, пора учиться! 😉', description: 'Продолжите курс «{{contentName}}»'},
    {
      title: 'Не хотите ли изучить {{givenName}}? 🚀',
      description: 'Пройдите курс «{{contentName}}»',
    },
    {
      title: 'Что сделано, то больше делать не нужно 🙃',
      description: 'Пройдите курс «{{contentName}}»',
    },
    {title: 'Ваш курс почти завершен! ✓', description: 'Завершите курс «{{contentName}}»'},
    {
      title: '{{givenName}}, Вы так близки к цели! 🙃',
      description: 'До завершения курса «{{contentName}}» осталось еще несколько вопросов',
    },
    {
      title: 'Давайте, {{givenName}}! Вы почти закончили ☑️',
      description: 'Пройдите курс «{{contentName}}»',
    },
  ],
  finishLearning: 'Сначала продолжите этот',
  forYou: 'Наша лучшая подборка для вас',
  gameOver: 'Конец игры',
  getAnExtralife: 'Получите дополнительную жизнь за просмотр урока',
  goodAnswer: 'Правильный ответ',
  goodJob: 'Отличная работа!',
  goToQuestion: 'Перейти к вопросу',
  highscore: 'У вас новый рекорд <br><b>вы только что выиграли {{score}} звезд(ы)</b>',
  howToSignIn: 'Вы получили электронное письмо для скачивания приложения?',
  iWantIt: 'Я хочу!',
  keyPoint: 'Ключевой момент',
  lesson: 'Урок',
  logOut: 'Выйти',
  needHelp: 'Нужна помощь?',
  new: 'Новые',
  next: 'Далее',
  nextChapter: 'Следующая глава',
  nextLevel: 'Следующий уровень',
  noResults: 'Нет результатов',
  noResultsDescription:
    'Ваш поиск не дал результатов.<br/>Попробуйте поиск по другим ключевым словам.',
  ok: 'Хорошо',
  ooops: 'Ой...',
  open: 'Открыть',
  openBrowser: 'Открыть <b>мой почтовый ящик</b>',
  openSettings: 'Открыть настройки',
  ouch: 'Ох...',
  outOfLives: 'У вас закончились жизни!',
  permission: 'Разрешение',
  permissionCamera:
    'Нам нужен доступ к вашей камере для сканирования вашего QR-кода и вашей аутентификации.',
  notificationSamples: [
    {title: 'Вызов дня 👊', description: 'Начать курс <br><b>Онлайн-клиент</b>'},
  ],
  permissionNotificationHeadline: 'мы поможем вам сохранять мотивацию!',
  permissionNotificationDescription:
    'Получайте уведомления и следите за достижением своих целей. Мы обещаем не взрывать ваш телефон уведомлениями миллион раз в день.',
  permissionNotificationAuthorize: 'Разрешить уведомления',
  currentlyDoingReminder: 'Напоминание о текущем деле',
  yesNotifyMe: 'Да, уведомить меня',
  maybeLater: 'Может, позже',
  platformHasBeenDisabled: 'Приложение отключено для вашей платформы',
  question: 'Вопрос',
  quit: 'Выйти',
  reactivatePlatform:
    'если вы захотите снова активировать его, свяжитесь с вашим менеджером или нажмите на ссылку внизу и мы передадим сообщение',
  refresh: 'Обновить',
  refreshEnjoyLearning: 'в сети между Сатурном и Землей, обновите, чтобы наслаждаться учебой',
  refreshNotWorking: 'Обновление не работает?',
  relatedSubjects: 'Рекомендовано вам:',
  resumeLearning: 'Продолжить обучение',
  retryChapter: 'Повторить главу',
  retryLevel: 'Повторить уровень',
  scanQRCode: 'Сканируйте свой <b>QR-код</b>',
  search: 'Поиск',
  seeClue: 'Смотреть подсказку',
  selectSomethingBelow: 'Выберите что-либо ниже',
  settings: 'Настройки',
  startDemo:
    'Нет аккаунта? <a href="/"><b><u>Начните бесплатное пробное использование!</u></b></a>',
  startLearning: 'Вам нужно начать с этого',
  selectAnAnswer: 'Выберите ответ',
  signInDesktop: 'Нет',
  signInMobile: 'Да',
  step: 'Этап',
  suggestion: 'Рекомендации курсов',
  suggestionWordings: [
    {
      title: '{{givenName}}, вот подходящий курс! 👀',
      description: 'Узнайте из этого курса «{{contentName}}»',
    },
    {
      title: 'Есть настроение учиться, {{givenName}}? 🚀',
      description: 'Посмотрите {{contentName}}',
    },
    {title: 'Ваша миссия, если вы решите ее принять 😎', description: 'Посмотрите {{contentName}}'},
    {title: '{{givenName}}, задача дня ждет вас! 😉', description: 'Начать курс {{contentName}}'},
    {title: '{{givenName}}, примите вызов 💪', description: 'Начать курс {{contentName}}'},
    {
      title: '{{givenName}}, расширяйте свой кругозор!',
      description: 'Узнайте больше о {{contentName}}',
    },
    {title: '{{givenName}}, пора учиться! 😉', description: 'Начать курс {{contentName}}'},
    {
      title: 'Пришло время (еще раз) запустить {{givenName}} 🚀',
      description: 'Начните курс «{{contentName}}»',
    },
    {
      title: '{{givenName}}, держим пари, что вы справитесь! 💪',
      description: 'Начать курс {{contentName}}',
    },
  ],
  typeHere: 'Введите текст здесь',
  validate: 'Подтвердить',
  version: 'Версия',
  videoLoadingError: 'Произошла ошибка при загрузке видео, попробуйте еще раз.',
  unlockNextLevel: 'Вы только что разблокировали<br><b>уровень {{levelName}}</b> ',
  upgrade: 'Обновить версию',
  upgradeDescription:
    'Ваше приложение обновлено! Загрузите последнюю версию для оптимального использования.',
  winAdditionalStars:
    'Выиграйте {{count}} дополнительных звезд в этой главе при первом просмотре урока!',
  welcome: 'Добро пожаловать',
  welcomeDescription:
    'Это приложение связано с вашей учетной записью на Учебной Платформе вашей компании.',
  welcomeUser: 'Добро пожаловать, {{displayname}}!',
  wrongAnswer: 'Неверный ответ',
  yourAnswer: 'Ваш ответ:',
  yourAnswers: 'Ваши ответы:',
};

export default translations;
