import type {Translations} from './_types';

const translations: Translations = {
  accessTheLesson: 'Доступ до уроку ',
  authenticationMagicLinkHeader:
    'Увійдіть до платформи через посилання, яке ви отримали в електронному листі',
  authenticationMagicLinkStepOneDescription:
    'Перейдіть у свою <b>робочу поштову скриньку</b> за допомогою цього телефону',
  authenticationMagicLinkStepTwoDescription:
    '<b>Відкрити лист</b> із запрошенням для звантаження застосунку Coorpacademy',
  authenticationMagicLinkStepThreeDescription:
    'Клацніть на кнопку <b>"Під\'єднатися до застосунку"</b>',
  authenticationMagicLinkTitle: 'Магічне Посилання',
  authenticationQRCodeHeader:
    "Не отримали електронного листа? Нічого! Ми підтвердимо вашу особу на веб-платформі за допомогою комп'ютера",
  authenticationQRCodeStepOneDescription: "Зв'яжіть вашу навчальну платформу <b>з комп'ютером</b>",
  authenticationQRCodeStepTwoDescription:
    'Перейдіть до <b>вашого облікового запису</b> <br/> у верхньому правому куті',
  authenticationQRCodeStepThreeDescription:
    '<b>Вуаля!</b><br/>Відскануйте свій QR-код, використовуючи кнопку нижче',
  authenticationQRCodeTitle: 'QR-код',
  askForHelp: 'Попросити про допомогу',
  backToHome: 'Назад на домашню сторінку',
  bonus: 'Бонус!',
  cancel: 'Відмінити',
  clue: 'Підказка',
  clueStarsToLoose:
    'Відкриття підказки зменшує кількість зірок за це питання на {{count}} (за умови правильної відповіді)',
  congratulations: 'Вітаємо!',
  connectionLost: 'No Internet connection',
  connectionRestored: 'You are now connected to the Internet',
  context: 'Контекст',
  correction: 'Виправлення',
  dataLost: 'Схоже, що ваші дані втрачено',
  didYouKnowThat: 'Ви знали це?',
  finishCourse: 'Фінішна пряма',
  finishCourseWordings: [
    {
      title: 'Зробімо це, {{givenName}}! 🚀',
      description: 'Завершіть цей курс: \\"{{contentName}}\\"',
    },
    {
      title: 'Ваша місія, якщо ви приймете її 😎',
      description: 'Завершіть свій курс: \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, закладаюся, що ви можете це зробити! 💪',
      description: 'Завершіть курс: \\"{{contentName}}\\"',
    },
    {
      title: 'Готові до навчання, {{givenName}}? 💪',
      description: 'Завершімо \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, ви близькі до завершення свого курсу 🙃',
      description: 'Давайте закінчимо \\"{{contentName}}\\"',
    },
    {
      title: 'Прийміть виклик, {{givenName}} 💪',
      description: 'Завершіть курс: \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, ваш виклик дня! 😉',
      description: 'Завершіть курс: \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, час навчатися! 😉',
      description: 'Продовжіть свій курс: \\"{{contentName}}\\"',
    },
    {
      title: 'Як щодо навчання, {{givenName}}? 🚀',
      description: 'Завершіть курс: \\"{{contentName}}\\"',
    },
    {
      title: 'Те, що зроблено, більше не має робитися 🙃',
      description: 'Завершіть курс: \\"{{contentName}}\\"',
    },
    {title: 'Ваш курс майже завершено! ✓', description: 'Завершіть курс: \\"{{contentName}}\\"'},
    {
      title: '{{givenName}}, ви так близько! 🙃',
      description: 'Більш ніж кілька запитань, щоб завершити \\"{{contentName}}\\"',
    },
    {
      title: 'Давай, {{givenName}}! Майже закінчено ☑️',
      description: 'Завершіть свій курс: \\"{{contentName}}\\"',
    },
  ],
  finishLearning: 'Спершу продовжте цей',
  forYou: 'Найкращі пропозиції для вас',
  gameOver: 'Кінець гри',
  getAnExtralife: 'Отримати додаткове життя після перегляду уроку',
  goodAnswer: 'Правильна відповідь',
  goodJob: 'Гарна робота!',
  goToQuestion: 'Перейти до запитання',
  highscore: 'У вас новий рекорд<br><b>ви щойно виграли {{score}} зірок</b>',
  howToSignIn: 'Ви отримали електронний лист для звантаження застосунку?',
  iWantIt: 'Хочу!',
  keyPoint: 'Ключовий момент',
  lesson: 'Урок',
  logOut: 'Вийти',
  needHelp: 'Потрібна допомога?',
  new: 'нові',
  next: 'Далі',
  nextChapter: 'Наступний розділ:',
  nextLevel: 'Наступний рівень',
  noResults: 'Немає результатів',
  noResultsDescription: 'Ваш пошук не дав результатів.<br/>Спробуйте пошукати інші ключові слова.',
  ok: 'Гаразд',
  ooops: 'Упс...',
  open: 'Відкрити',
  openBrowser: 'Відкрити <b>мою поштову скриньку</b>',
  openSettings: 'Відкрити налаштування',
  ouch: 'Ой...',
  outOfLives: 'У Вас закінчилися життя!',
  permission: 'Дозвіл',
  permissionCamera:
    'Нам потрібно отримати доступ до вашої камери, щоб відсканувати ваш QR-код і автентифікувати вас.',
  notificationSamples: [
    {title: 'Виклик дня 👊', description: 'Розпочати курс<br><b>Онлайн-покупець</b>'},
  ],
  permissionNotificationHeadline: 'Ми допомагаємо вам лишатись мотивованими!',
  permissionNotificationDescription:
    'Отримуйте сповіщення та підкорюйте свої цілі. Обіцяємо не підривати ваш телефон мільйон разів на день.',
  permissionNotificationAuthorize: 'Авторизуйте сповіщення',
  currentlyDoingReminder: 'Зараз створюється нагадування',
  yesNotifyMe: 'Так, сповістіть мене',
  maybeLater: 'Можливо пізніше',
  platformHasBeenDisabled: 'Застосунок було вимкнено для вашої платформи',
  question: 'Питання',
  quit: 'Вийти',
  reactivatePlatform:
    "якщо ви хочете знову його активувати, зв'яжіться з вашим менеджером або клацніть на посиланні нижче і ми передамо це повідомлення",
  refresh: 'Оновити',
  refreshEnjoyLearning:
    'у мережі між Сатурном та Землею, будь ласка, оновіть сторінку, щоб насолоджуватись навчанням',
  refreshNotWorking: 'Оновлення не працює?',
  relatedSubjects: 'Рекомендовано для Вас:',
  resumeLearning: 'Продовжити навчання',
  retryChapter: 'Пройти розділ ще раз',
  retryLevel: 'Пройти рівень ще раз',
  scanQRCode: 'Відскануйте свій <b>QR-код</b>',
  search: 'Шукати',
  seeClue: 'Переглянути підказку',
  selectSomethingBelow: 'Оберіть положення нижче',
  settings: 'Налаштування',
  startDemo:
    'Не маєте облікового запису? <a href="/"><b><u> Розпочніть пробний період!</u></b></a>',
  startLearning: 'Вам слід почати з цього',
  selectAnAnswer: 'Обрати відповідь',
  signInDesktop: 'Ні',
  signInMobile: 'Так',
  step: 'Крок',
  suggestion: 'Пропозиція курсу',
  suggestionWordings: [
    {
      title: '{{givenName}}, ось курс для тебе! 👀',
      description: 'Дізнайся на цьому курсі \\"{{contentName}}\\"',
    },
    {
      title: 'Маєш настрій вчитись, {{givenName}}? 🚀',
      description: 'Подивися \\"{{contentName}}\\"',
    },
    {
      title: 'Твоє завдання, якщо ти вирішиши його прийняти 😎',
      description: 'Подивися \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, твій виклик дня чекає на тебе! 😉',
      description: 'Розпочни курс \\"{{contentName}}\\"',
    },
    {title: '{{givenName}}, прийми виклик 💪', description: 'Розпочни курс \\"{{contentName}}\\"'},
    {
      title: '{{givenName}}, розширюй свої горизонти!',
      description: 'Дізнайся більше про \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, настав час вчитися! 😉',
      description: 'Розпочни курс \\"{{contentName}}\\"',
    },
    {
      title: 'Настав час (пере) запустити, {{givenName}} 🚀',
      description: 'Розпочни цей курс \\"{{contentName}}\\"',
    },
    {
      title: '{{givenName}}, закладаюся, ти зможеш зробити це! 💪',
      description: 'Розпочни курс \\"{{contentName}}\\"',
    },
  ],
  typeHere: 'Ввести тут',
  validate: 'Підтвердити',
  version: 'Версія',
  videoLoadingError: 'Під час завантаження відео сталася помилка. Повторіть ще раз.',
  unlockNextLevel: 'Ви щойно розблокували<br><b>рівень {{levelName}}</b>',
  upgrade: 'Перейти на кращу версію',
  upgradeDescription:
    'Ваш застосунок було оновлено! Будь ласка, завантажте останню версію, щоб насолодитись нею.',
  winAdditionalStars:
    'Вигравайте {{count}} додаткових зірок за перший перегляд уроку в цьому розділі!',
  welcome: 'Ласкаво просимо',
  welcomeDescription:
    "Цей застосунок прив'язаний до вашого облікового запису на Навчальній платформі вашої компанії.",
  welcomeUser: 'Ласкаво просимо, {{displayname}}!',
  wrongAnswer: 'Неправильна відповідь',
  yourAnswer: 'Ваша відповідь:',
  yourAnswers: 'Ваші відповіді:',
};

export default translations;
